стоп-кнопка
активация окна стим, если невозможно - выход с сообщением об ошибке с указанием причины выхода
форма с возможностью запуска какого-то конкретного бота. на данном этапе только этот. в дальнейшем, возможность выбора бота

выставляется определенный масштаб и появляется сообщение - расставьте метки зеленого цвета для опередления поиска области работы, метку красного увета для возврата домой,
установите флоты 1,2,3,4,5 для поиска и в поле введите номера флотов, которыми можно их фармить и нажмите ок
определение области работы (по меткам) с занесением пяти координат в переменные. Если в течении х-секунд обнаружено менее 5 меток, то сообщение об ошибке и выход, с указанием причины выхода

если все хорошо, то имеем 5 координат и готовы приступить - нажать кнопку старт (возможность обозначить время работы, паузы - расписание)
проверяем, по расписанию бот должен спать или фармить?
выставляется масштаб, центрируемся, нажимаем кнопку поиска х-флота
проверка, не вышли ли за пределы поиска
если вышли, то в исходную, пробуем найти второй флот, и так далее, после перебора всех утсановленных флотов для фарма ждем какое-то время и повторяем поиск,
если не вышли, то берем х-флот и атакуем
следим, что флот двигается,
если не двигается - выход с указанием причины выхода
если жвигается, ждем, когда начнет атаковать или остановится (перехватили)
если перехватили, то в исходную, ждем какое-то время и пробуем опять
если атака прошла, то ждем когда атака закончится
когда атака закончилась, летим на базу и ремонтируемся
после того как отремантировались начинаем сначала



